#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + signing_certificate             = (known after apply)
      + signing_certificate_sha1        = (known after apply)
      + signing_private_key             = (known after apply)
      + signing_private_key_sha1        = (known after apply)
      + valid_redirect_uris             = [
          + "https://hlbc.fonemedhms.com/*",
        ]
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.FLORIZEL.keycloak_saml_user_property_protocol_mapper.saml_user_email_mapper will be created
  + resource "keycloak_saml_user_property_protocol_mapper" "saml_user_email_mapper" {
      + client_id                  = (known after apply)
      + friendly_name              = "email"
      + id                         = (known after apply)
      + name                       = "email"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "email"
      + saml_attribute_name_format = "Basic"
      + user_property              = "email"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.FLORIZEL.keycloak_saml_user_property_protocol_mapper.saml_user_first_name_mapper will be created
  + resource "keycloak_saml_user_property_protocol_mapper" "saml_user_first_name_mapper" {
      + client_id                  = (known after apply)
      + friendly_name              = "firstName"
      + id                         = (known after apply)
      + name                       = "firstName"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "firstName"
      + saml_attribute_name_format = "Basic"
      + user_property              = "firstName"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.FLORIZEL.keycloak_saml_user_property_protocol_mapper.saml_user_last_name_mapper will be created
  + resource "keycloak_saml_user_property_protocol_mapper" "saml_user_last_name_mapper" {
      + client_id                  = (known after apply)
      + friendly_name              = "lastName"
      + id                         = (known after apply)
      + name                       = "lastName"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "lastName"
      + saml_attribute_name_format = "Basic"
      + user_property              = "lastName"
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-florizel"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "64028a9d-1033-438f-8db8-681dc0a97e51"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_PROD.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-florizel"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "bd2e86ec-254f-4ddf-82f3-6e31e70b5bd8"
      + id        = (known after apply)
      + name      = "view-client-florizel"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-florizel"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["USER-MANAGEMENT-SERVICE/view-client-florizel-training"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = "cc4d80a5-4a1c-4d80-a2c3-59d3ebde880d"
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-florizel"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-florizel"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-florizel-training"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-florizel-training"
      + realm_id  = "moh_applications"
    }

Plan: 16 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*